---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NoSwapGroupBeingEdited
source: html/f195adf8-6bf6-ede4-8c2f-7a7e5ef1928e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NoSwapGroupBeingEdited Property

You may not change the type of the group that is currently being edited.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSwapGroupBeingEdited { get; }
```